In [1]:
from pandas import Series, DataFrame
import numpy as np
import pandas as pd

# 1 pandas数据结构介绍

  1.1 序列（Series）
    - 索引
    - 分片
    - 字典操作
    - 索引自动对齐运算
    - name 属性
  1.2 数据框（DataFrame）
    - columns
    - index
    - 索引和切片
    - 弹出（pop）
    - .T 可以转置数据框
  1.3 Panel

# 2 索引对象

In [2]:
s = Series(range(3), index=['a', 'b', 'c'])

In [3]:
s.index

Index(['a', 'b', 'c'], dtype='object')

In [4]:
s.index[1:2]

Index(['b'], dtype='object')

索引对象不允许被修改

In [5]:
ss = Series(range(3, 6), index=s.index)

In [6]:
ss.index is s.index

True

# 3 核心的基本函数

- .head()
- .tail()
- .shape
- .values
- .reindex() 改变索引，创建一个新的对象

# 4 索引和旋转

object.ix[] 语法支持整数和标签混合使用进行索引，虽然语法很强大，但这种索引方法常常让使用者感到困惑。我们更喜欢更加严格的[]、iloc、loc语法进行索引。

In [7]:
dates = pd.date_range('2017-5-15', periods=8)

In [8]:
df = pd.DataFrame(np.random.randn(8, 4), index=dates, columns=['a', 'b', 'c', 'd'])

In [9]:
df

                   a         b         c         d
2017-05-15  0.032399  1.009382 -1.466105  1.209659
2017-05-16 -0.978318 -0.139262  0.759326 -0.982601
2017-05-17  0.456404 -0.885288 -0.366270 -0.822046
2017-05-18 -1.095931  0.265904  2.012881 -1.059729
2017-05-19 -1.059225 -1.392652 -0.160509 -0.045308
2017-05-20  0.204417 -0.165530  1.940536  0.461494
2017-05-21 -0.071625 -0.238433  0.618127  0.677779
2017-05-22  0.478503  0.414292 -1.709955  0.507993

In [10]:
s = df['a']  # []索引

In [11]:
s

2017-05-15    0.032399
2017-05-16   -0.978318
2017-05-17    0.456404
2017-05-18   -1.095931
2017-05-19   -1.059225
2017-05-20    0.204417
2017-05-21   -0.071625
2017-05-22    0.478503
Freq: D, Name: a, dtype: float64

In [12]:
df[['a', 'b']]  #索引多列

                   a         b
2017-05-15  0.032399  1.009382
2017-05-16 -0.978318 -0.139262
2017-05-17  0.456404 -0.885288
2017-05-18 -1.095931  0.265904
2017-05-19 -1.059225 -1.392652
2017-05-20  0.204417 -0.165530
2017-05-21 -0.071625 -0.238433
2017-05-22  0.478503  0.414292

loc 语法是严格基于标签的，其接收的标签对象包括：
  - 一个标签
  - 一列标签， ['a', 'b']
  - 标签的一个分片 'a':'f'，标签的开始和结束位置都会包括在内。
  - 单参的可调用对象

In [13]:
df.loc[:, 'a':'c']

                   a         b         c
2017-05-15  0.032399  1.009382 -1.466105
2017-05-16 -0.978318 -0.139262  0.759326
2017-05-17  0.456404 -0.885288 -0.366270
2017-05-18 -1.095931  0.265904  2.012881
2017-05-19 -1.059225 -1.392652 -0.160509
2017-05-20  0.204417 -0.165530  1.940536
2017-05-21 -0.071625 -0.238433  0.618127
2017-05-22  0.478503  0.414292 -1.709955

iloc语法是基于位置的，可以使用布尔数组进行筛选。如果请求的索引超出数据框的边界，抛出IndexError异常。其接收的参数包括：
  -  一个整数，如 5
  - 一个整数序列，[1, 2, 3]
  - 一个分片对象，如 1:7
  - 一个布尔数组
  - 单参数的可调用函数

In [14]:
df.iloc[:4, :3] # 前4行和前3列

                   a         b         c
2017-05-15  0.032399  1.009382 -1.466105
2017-05-16 -0.978318 -0.139262  0.759326
2017-05-17  0.456404 -0.885288 -0.366270
2017-05-18 -1.095931  0.265904  2.012881

# 5 算术运算与对齐

In [15]:
a = Series([1, 2, 3, 4], index=['d', 'b', 'c', 'a'])
b = Series([5, 6, 7, 8], index=['b', 'd', 'e', 'f'])

In [16]:
a+b # 公共的索引才计算，不同的为NaN

a    NaN
b    7.0
c    NaN
d    7.0
e    NaN
f    NaN
dtype: float64

 - DataFrame + DataFrame也同样使用上面的规则（行列相同的计算，不同的为NaN）。
 - DataFrame + Series 会使用到数组扩充的转换机制。

# 6 处理默认值

np.nan和Python中的None也被认为是默认值。

In [17]:
data = Series([np.nan, None, 'cat', 'dog'])

In [18]:
data

0     NaN
1    None
2     cat
3     dog
dtype: object

In [19]:
data.isnull()

0     True
1     True
2    False
3    False
dtype: bool

In [20]:
np.nan ==np.nan

False

使用 fillna() 函数填充默认值。

In [21]:
df = DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f', 'h'], columns=['one', 'two', 'three'])

In [22]:
df = df.reindex(['a', 'b', 'c', 'd', 'e'])

In [23]:
df

        one       two     three
a  0.396363  1.080155 -0.593960
b       NaN       NaN       NaN
c -0.112281 -1.254428 -0.632687
d       NaN       NaN       NaN
e  0.100609 -0.560667  0.520335

In [24]:
df.fillna(1)

        one       two     three
a  0.396363  1.080155 -0.593960
b  1.000000  1.000000  1.000000
c -0.112281 -1.254428 -0.632687
d  1.000000  1.000000  1.000000
e  0.100609 -0.560667  0.520335

In [25]:
df.loc['e'] = None

In [26]:
df

        one       two     three
a  0.396363  1.080155 -0.593960
b       NaN       NaN       NaN
c -0.112281 -1.254428 -0.632687
d       NaN       NaN       NaN
e       NaN       NaN       NaN

In [27]:
df.fillna(method='pad', limit=1)  # 使用该行的上一行填充数据

        one       two     three
a  0.396363  1.080155 -0.593960
b  0.396363  1.080155 -0.593960
c -0.112281 -1.254428 -0.632687
d -0.112281 -1.254428 -0.632687
e       NaN       NaN       NaN

使用 dropna() 丢弃掉默认值的行或者列。

In [28]:
df.dropna(axis=0) # drop行

        one       two     three
a  0.396363  1.080155 -0.593960
c -0.112281 -1.254428 -0.632687

In [29]:
df.dropna(axis=1) # drop列

Empty DataFrame
Columns: []
Index: [a, b, c, d, e]

`interpolate() `提供了多种插值的方法，平方插值、立方插值等。